In [2]:
import pandas as pd
df=pd.read_excel(r"C:\Users\keerthi\Documents\weather_data.xlsx")
df

        Date       City  Temperature_C  Humidity_%  Wind_kmph
0 2025-01-01  Hyderabad             22          55         10
1 2025-01-02  Hyderabad             23          60         12
2 2025-01-03  Hyderabad             25          58         11
3 2025-01-04  Hyderabad             24          62         14
4 2025-01-05  Hyderabad             26          65          9
5 2025-01-06  Hyderabad             27          59         13
6 2025-01-07  Hyderabad             28          57         15
7 2025-01-08  Hyderabad             29          61         10
8 2025-01-09  Hyderabad             30          63         12
9 2025-01-10  Hyderabad             31          66         11

In [3]:
df.isnull()

    Date   City  Temperature_C  Humidity_%  Wind_kmph
0  False  False          False       False      False
1  False  False          False       False      False
2  False  False          False       False      False
3  False  False          False       False      False
4  False  False          False       False      False
5  False  False          False       False      False
6  False  False          False       False      False
7  False  False          False       False      False
8  False  False          False       False      False
9  False  False          False       False      False

In [4]:
df.head()

        Date       City  Temperature_C  Humidity_%  Wind_kmph
0 2025-01-01  Hyderabad             22          55         10
1 2025-01-02  Hyderabad             23          60         12
2 2025-01-03  Hyderabad             25          58         11
3 2025-01-04  Hyderabad             24          62         14
4 2025-01-05  Hyderabad             26          65          9

In [5]:
df.tail()

        Date       City  Temperature_C  Humidity_%  Wind_kmph
5 2025-01-06  Hyderabad             27          59         13
6 2025-01-07  Hyderabad             28          57         15
7 2025-01-08  Hyderabad             29          61         10
8 2025-01-09  Hyderabad             30          63         12
9 2025-01-10  Hyderabad             31          66         11

In [7]:
df['Temperature_C']=df['Temperature_C'].fillna(df['Temperature_C'].mean())
df

        Date       City  Temperature_C  Humidity_%  Wind_kmph
0 2025-01-01  Hyderabad             22          55         10
1 2025-01-02  Hyderabad             23          60         12
2 2025-01-03  Hyderabad             25          58         11
3 2025-01-04  Hyderabad             24          62         14
4 2025-01-05  Hyderabad             26          65          9
5 2025-01-06  Hyderabad             27          59         13
6 2025-01-07  Hyderabad             28          57         15
7 2025-01-08  Hyderabad             29          61         10
8 2025-01-09  Hyderabad             30          63         12
9 2025-01-10  Hyderabad             31          66         11

In [9]:
df['Humidity_%']=df['Humidity_%'].fillna(df['Humidity_%'].sum())
df

        Date       City  Temperature_C  Humidity_%  Wind_kmph
0 2025-01-01  Hyderabad             22          55         10
1 2025-01-02  Hyderabad             23          60         12
2 2025-01-03  Hyderabad             25          58         11
3 2025-01-04  Hyderabad             24          62         14
4 2025-01-05  Hyderabad             26          65          9
5 2025-01-06  Hyderabad             27          59         13
6 2025-01-07  Hyderabad             28          57         15
7 2025-01-08  Hyderabad             29          61         10
8 2025-01-09  Hyderabad             30          63         12
9 2025-01-10  Hyderabad             31          66         11

In [11]:
df.shape

(10, 5)

In [12]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Wind_kmph'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
df.dtypes

Date             datetime64[ns]
City                     object
Temperature_C             int64
Humidity_%                int64
Wind_kmph                 int64
dtype: object

In [17]:
df.City

0    Hyderabad
1    Hyderabad
2    Hyderabad
3    Hyderabad
4    Hyderabad
5    Hyderabad
6    Hyderabad
7    Hyderabad
8    Hyderabad
9    Hyderabad
Name: City, dtype: object

In [18]:
df.info

<bound method DataFrame.info of         Date       City  Temperature_C  Humidity_%  Wind_kmph
0 2025-01-01  Hyderabad             22          55         10
1 2025-01-02  Hyderabad             23          60         12
2 2025-01-03  Hyderabad             25          58         11
3 2025-01-04  Hyderabad             24          62         14
4 2025-01-05  Hyderabad             26          65          9
5 2025-01-06  Hyderabad             27          59         13
6 2025-01-07  Hyderabad             28          57         15
7 2025-01-08  Hyderabad             29          61         10
8 2025-01-09  Hyderabad             30          63         12
9 2025-01-10  Hyderabad             31          66         11>

## exploring data

In [22]:
ai=pd.DataFrame({
    "name":["dinesh","navadeep","raju"],
    "age":[45,30,12]
})
ai

       name  age
0    dinesh   45
1  navadeep   30
2      raju   12

In [25]:
ds=pd.DataFrame({
    "name":["akhii","suji","kaveri"],
    "age":[45,3,12]
})
ds

     name  age
0   akhii   45
1    suji    3
2  kaveri   12

In [26]:
a=pd.merge(ai,ds,on='name')
a

Empty DataFrame
Columns: [name, age_x, age_y]
Index: []

In [27]:
df=pd.concat([ai,ds],ignore_index=True)
df

       name  age
0    dinesh   45
1  navadeep   30
2      raju   12
3     akhii   45
4      suji    3
5    kaveri   12

In [28]:
a=pd.merge(ai,ds,on="age")
a

   name_x  age  name_y
0  dinesh   45   akhii
1    raju   12  kaveri